Enums/ВидыЗастрахованныхЛицОбязательногоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыЗастрахованныхЛицОбязательногоСтрахования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГражданеРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостоянноПроживающиеИностранцы</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВысококвалифицированныеСпециалистыПостоянноПроживающие</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноПроживающиеИностранцы</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВысококвалифицированныеСпециалистыВременноПроживающие</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноПребывающиеИностранцы</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноПребывающиеИностранцыПризнанныеБеженцами</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноПребывающиеИностранцыСДолгосрочнымиДоговорами</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноПребывающиеИностранцыНестрахуемые</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВысококвалифицированныеСпециалистыИзЕАЭС</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноПребывающиеИностранцыСтрахуемыеФСС</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВысококвалифицированныеСпециалистыНестрахуемые</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗастрахованныхЛицОбязательногоСтрахования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	БезПроизводныхЗначений = Неопределено;
	Параметры.Свойство("БезПроизводныхЗначений", БезПроизводныхЗначений);
	
	Если БезПроизводныхЗначений = Истина Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ, НСтр("ru = 'Гражданин Российской Федерации'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, подлежащий страхованию кроме высококвалифицированных иностранных специалистов'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами, НСтр("ru = 'Иностранец, которому предоставлено временное убежище, временно пребывающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы, НСтр("ru = 'Приравнен к гражданам РФ (постоянно проживает, признан беженцем, гражданин страны-участника Договора о ЕАЭС)'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, не подлежащий страхованию кроме высококвалифицированных иностранных специалистов'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы, НСтр("ru = 'Иностранец, временно проживающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, постоянно проживающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, временно проживающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи из страны-участника Договора о ЕАЭС, временно пребывающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыНестрахуемые, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, временно пребывающий на территории РФ, не подлежащий страхованию'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, до 2023 года не подлежавший страхованию на ОПС и ОМС в соответствии с международным договором'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает виды застрахованных лиц, которые относятся к высококвалифицированным специалистам.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.ВидыЗастрахованныхЛицОбязательногоСтрахования
//
Функция ВысококвалифицированныеСпециалисты() Экспорт
	
	Категории = Новый Массив;
	Категории.Добавить(ВысококвалифицированныеСпециалистыВременноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыПостоянноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыИзЕАЭС);
	Категории.Добавить(ВысококвалифицированныеСпециалистыНестрахуемые);
	
	Возврат Категории;
	
КонецФункции

// Возвращает виды застрахованных лиц, которые являются валютными резидентами.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.ВидыЗастрахованныхЛицОбязательногоСтрахования
//
Функция ВалютныеРезиденты() Экспорт
	
	ВалютныеРезиденты = Новый Массив;
	ВалютныеРезиденты.Добавить(ГражданеРФ);
	ВалютныеРезиденты.Добавить(ПостоянноПроживающиеИностранцы);
	ВалютныеРезиденты.Добавить(ВысококвалифицированныеСпециалистыПостоянноПроживающие);
	
	Возврат ВалютныеРезиденты;
	
КонецФункции

#КонецОбласти

#КонецЕсли
